Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/0.1/PIC32MZEF/atdf/PIC32MZ0512EFE144.atdf
         <register caption="" name="ANSELJ" offset="0x800" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ANSJ0"/>
            <bitfield mask="0x00000002" name="ANSJ1"/>
            <bitfield mask="0x00000004" name="ANSJ2"/>
            <bitfield mask="0x00000008" name="ANSJ3"/>
            <bitfield mask="0x00000010" name="ANSJ4"/>
            <bitfield mask="0x00000020" name="ANSJ5"/>
            <bitfield mask="0x00000040" name="ANSJ6"/>
            <bitfield mask="0x00000080" name="ANSJ7"/>
            <bitfield mask="0x00000100" name="ANSJ8"/>
            <bitfield mask="0x00000200" name="ANSJ9"/>
            <bitfield mask="0x00000400" name="ANSJ10"/>
            <bitfield mask="0x00000800" name="ANSJ11"/>
            <bitfield mask="0x00001000" name="ANSJ12"/>
            <bitfield mask="0x00002000" name="ANSJ13"/>
            <bitfield mask="0x00004000" name="ANSJ14"/>
            <bitfield mask="0x00008000" name="ANSJ15"/>
         </register>
         <register caption="" name="TRISA" offset="0x10" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TRISA0"/>
            <bitfield mask="0x00000002" name="TRISA1"/>
            <bitfield mask="0x00000004" name="TRISA2"/>
            <bitfield mask="0x00000008" name="TRISA3"/>
            <bitfield mask="0x00000010" name="TRISA4"/>
            <bitfield mask="0x00000020" name="TRISA5"/>
            <bitfield mask="0x00000040" name="TRISA6"/>
            <bitfield mask="0x00000080" name="TRISA7"/>
            <bitfield mask="0x00000100" name="TRISA8"/>
            <bitfield mask="0x00000200" name="TRISA9"/>
            <bitfield mask="0x00000400" name="TRISA10"/>
            <bitfield mask="0x00000800" name="TRISA11"/>
            <bitfield mask="0x00001000" name="TRISA12"/>
            <bitfield mask="0x00002000" name="TRISA13"/>
            <bitfield mask="0x00004000" name="TRISA14"/>
            <bitfield mask="0x00008000" name="TRISA15"/>
         </register>
         <register caption="" name="TRISB" offset="0x110" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TRISB0"/>
            <bitfield mask="0x00000002" name="TRISB1"/>
            <bitfield mask="0x00000004" name="TRISB2"/>
            <bitfield mask="0x00000008" name="TRISB3"/>
            <bitfield mask="0x00000010" name="TRISB4"/>
            <bitfield mask="0x00000020" name="TRISB5"/>
            <bitfield mask="0x00000040" name="TRISB6"/>
            <bitfield mask="0x00000080" name="TRISB7"/>
            <bitfield mask="0x00000100" name="TRISB8"/>
            <bitfield mask="0x00000200" name="TRISB9"/>
            <bitfield mask="0x00000400" name="TRISB10"/>
            <bitfield mask="0x00000800" name="TRISB11"/>
            <bitfield mask="0x00001000" name="TRISB12"/>
            <bitfield mask="0x00002000" name="TRISB13"/>
            <bitfield mask="0x00004000" name="TRISB14"/>
            <bitfield mask="0x00008000" name="TRISB15"/>
         </register>
         <register caption="" name="TRISC" offset="0x210" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TRISC0"/>
            <bitfield mask="0x00000002" name="TRISC1"/>
            <bitfield mask="0x00000004" name="TRISC2"/>
            <bitfield mask="0x00000008" name="TRISC3"/>
            <bitfield mask="0x00000010" name="TRISC4"/>
            <bitfield mask="0x00000020" name="TRISC5"/>
            <bitfield mask="0x00000040" name="TRISC6"/>
            <bitfield mask="0x00000080" name="TRISC7"/>
            <bitfield mask="0x00000100" name="TRISC8"/>
            <bitfield mask="0x00000200" name="TRISC9"/>
            <bitfield mask="0x00000400" name="TRISC10"/>
            <bitfield mask="0x00000800" name="TRISC11"/>
            <bitfield mask="0x00001000" name="TRISC12"/>
            <bitfield mask="0x00002000" name="TRISC13"/>
            <bitfield mask="0x00004000" name="TRISC14"/>
            <bitfield mask="0x00008000" name="TRISC15"/>
         </register>
         <register caption="" name="TRISD" offset="0x310" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TRISD0"/>
            <bitfield mask="0x00000002" name="TRISD1"/>
            <bitfield mask="0x00000004" name="TRISD2"/>
            <bitfield mask="0x00000008" name="TRISD3"/>
            <bitfield mask="0x00000010" name="TRISD4"/>
            <bitfield mask="0x00000020" name="TRISD5"/>
            <bitfield mask="0x00000040" name="TRISD6"/>
            <bitfield mask="0x00000080" name="TRISD7"/>
            <bitfield mask="0x00000100" name="TRISD8"/>
            <bitfield mask="0x00000200" name="TRISD9"/>
            <bitfield mask="0x00000400" name="TRISD10"/>
            <bitfield mask="0x00000800" name="TRISD11"/>
            <bitfield mask="0x00001000" name="TRISD12"/>
            <bitfield mask="0x00002000" name="TRISD13"/>
            <bitfield mask="0x00004000" name="TRISD14"/>
            <bitfield mask="0x00008000" name="TRISD15"/>
         </register>
         <register caption="" name="TRISE" offset="0x410" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TRISE0"/>
            <bitfield mask="0x00000002" name="TRISE1"/>
            <bitfield mask="0x00000004" name="TRISE2"/>
            <bitfield mask="0x00000008" name="TRISE3"/>
            <bitfield mask="0x00000010" name="TRISE4"/>
            <bitfield mask="0x00000020" name="TRISE5"/>
            <bitfield mask="0x00000040" name="TRISE6"/>
            <bitfield mask="0x00000080" name="TRISE7"/>
            <bitfield mask="0x00000100" name="TRISE8"/>
            <bitfield mask="0x00000200" name="TRISE9"/>
            <bitfield mask="0x00000400" name="TRISE10"/>
            <bitfield mask="0x00000800" name="TRISE11"/>
            <bitfield mask="0x00001000" name="TRISE12"/>
            <bitfield mask="0x00002000" name="TRISE13"/>
            <bitfield mask="0x00004000" name="TRISE14"/>
            <bitfield mask="0x00008000" name="TRISE15"/>
         </register>
         <register caption="" name="TRISF" offset="0x510" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TRISF0"/>
            <bitfield mask="0x00000002" name="TRISF1"/>
            <bitfield mask="0x00000004" name="TRISF2"/>
            <bitfield mask="0x00000008" name="TRISF3"/>
            <bitfield mask="0x00000010" name="TRISF4"/>
            <bitfield mask="0x00000020" name="TRISF5"/>
            <bitfield mask="0x00000040" name="TRISF6"/>
            <bitfield mask="0x00000080" name="TRISF7"/>
            <bitfield mask="0x00000100" name="TRISF8"/>
            <bitfield mask="0x00000200" name="TRISF9"/>
            <bitfield mask="0x00000400" name="TRISF10"/>
            <bitfield mask="0x00000800" name="TRISF11"/>
            <bitfield mask="0x00001000" name="TRISF12"/>
            <bitfield mask="0x00002000" name="TRISF13"/>
            <bitfield mask="0x00004000" name="TRISF14"/>
            <bitfield mask="0x00008000" name="TRISF15"/>
         </register>
         <register caption="" name="TRISG" offset="0x610" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TRISG0"/>
            <bitfield mask="0x00000002" name="TRISG1"/>
            <bitfield mask="0x00000004" name="TRISG2"/>
            <bitfield mask="0x00000008" name="TRISG3"/>
            <bitfield mask="0x00000010" name="TRISG4"/>
            <bitfield mask="0x00000020" name="TRISG5"/>
            <bitfield mask="0x00000040" name="TRISG6"/>
            <bitfield mask="0x00000080" name="TRISG7"/>
            <bitfield mask="0x00000100" name="TRISG8"/>
            <bitfield mask="0x00000200" name="TRISG9"/>
            <bitfield mask="0x00000400" name="TRISG10"/>
            <bitfield mask="0x00000800" name="TRISG11"/>
            <bitfield mask="0x00001000" name="TRISG12"/>
            <bitfield mask="0x00002000" name="TRISG13"/>
            <bitfield mask="0x00004000" name="TRISG14"/>
            <bitfield mask="0x00008000" name="TRISG15"/>
         </register>
