Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/0.1/PIC32MZEF/atdf/PIC32MZ0512EFE144.atdf
      <value-group caption="RX FIFO Empty bit (valid only when ENHBUF = 1)" name="SPI2STAT__SPIRBE">
         <value caption="RX FIFO is empty (CRPTR = SWPTR)" name="" value="0x1"/>
         <value caption="RX FIFO is not empty (CRPTR ? SWPTR)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Receive Overflow Flag bit" name="SPI2STAT__SPIROV">
         <value caption="A new data is completely received and discarded. The user software has not read the previous data in the SPIxBUF register." name="" value="0x1"/>
         <value caption="No overflow has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Shift Register Empty bit" name="SPI2STAT__SRMT">
         <value caption="When SPI module shift register is empty" name="" value="0x1"/>
         <value caption="When SPI module shift register is not empty" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit Under Run bit" name="SPI2STAT__SPITUR">
         <value caption="Transmit buffer has encountered an underrun condition" name="" value="0x1"/>
         <value caption="Transmit buffer has no underrun condition" name="" value="0x0"/>
      </value-group>
      <value-group caption="SPI Activity Status bit" name="SPI2STAT__SPIBUSY">
         <value caption="SPI peripheral is currently busy with some transactions" name="" value="0x1"/>
         <value caption="SPI peripheral is currently idle" name="" value="0x0"/>
      </value-group>
      <value-group caption="SPI Frame Error status bit" name="SPI2STAT__FRMERR">
         <value caption="Frame error detected" name="" value="0x1"/>
         <value caption="No Frame error detected" name="" value="0x0"/>
      </value-group>
      <value-group caption="SPI Receive Buffer Full Status bit" name="SPI3STAT__SPIRBF">
         <value caption="Receive buffer" name="" value="0x1"/>
         <value caption="Receive buffer" name="" value="0x0"/>
      </value-group>
      <value-group caption="SPI Transmit Buffer Full Status bit" name="SPI3STAT__SPITBF">
         <value caption="Transmit not yet started" name="" value="0x1"/>
         <value caption="Transmit buffer is not full" name="" value="0x0"/>
      </value-group>
      <value-group caption="SPI Transmit Buffer Empty Status bit" name="SPI3STAT__SPITBE">
         <value caption="Transmit buffer" name="" value="0x1"/>
         <value caption="Transmit buffer" name="" value="0x0"/>
      </value-group>
      <value-group caption="RX FIFO Empty bit (valid only when ENHBUF = 1)" name="SPI3STAT__SPIRBE">
         <value caption="RX FIFO is empty (CRPTR = SWPTR)" name="" value="0x1"/>
         <value caption="RX FIFO is not empty (CRPTR ? SWPTR)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Receive Overflow Flag bit" name="SPI3STAT__SPIROV">
         <value caption="A new data is completely received and discarded. The user software has not read the previous data in the SPIxBUF register." name="" value="0x1"/>
         <value caption="No overflow has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Shift Register Empty bit" name="SPI3STAT__SRMT">
         <value caption="When SPI module shift register is empty" name="" value="0x1"/>
         <value caption="When SPI module shift register is not empty" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit Under Run bit" name="SPI3STAT__SPITUR">
         <value caption="Transmit buffer has encountered an underrun condition" name="" value="0x1"/>
         <value caption="Transmit buffer has no underrun condition" name="" value="0x0"/>
      </value-group>
      <value-group caption="SPI Activity Status bit" name="SPI3STAT__SPIBUSY">
         <value caption="SPI peripheral is currently busy with some transactions" name="" value="0x1"/>
         <value caption="SPI peripheral is currently idle" name="" value="0x0"/>
      </value-group>
      <value-group caption="SPI Frame Error status bit" name="SPI3STAT__FRMERR">
         <value caption="Frame error detected" name="" value="0x1"/>
         <value caption="No Frame error detected" name="" value="0x0"/>
      </value-group>
      <value-group caption="SPI Receive Buffer Full Status bit" name="SPI4STAT__SPIRBF">
         <value caption="Receive buffer" name="" value="0x1"/>
         <value caption="Receive buffer" name="" value="0x0"/>
      </value-group>
      <value-group caption="SPI Transmit Buffer Full Status bit" name="SPI4STAT__SPITBF">
         <value caption="Transmit not yet started" name="" value="0x1"/>
         <value caption="Transmit buffer is not full" name="" value="0x0"/>
      </value-group>
      <value-group caption="SPI Transmit Buffer Empty Status bit" name="SPI4STAT__SPITBE">
         <value caption="Transmit buffer" name="" value="0x1"/>
         <value caption="Transmit buffer" name="" value="0x0"/>
      </value-group>
      <value-group caption="RX FIFO Empty bit (valid only when ENHBUF = 1)" name="SPI4STAT__SPIRBE">
         <value caption="RX FIFO is empty (CRPTR = SWPTR)" name="" value="0x1"/>
         <value caption="RX FIFO is not empty (CRPTR ? SWPTR)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Receive Overflow Flag bit" name="SPI4STAT__SPIROV">
         <value caption="A new data is completely received and discarded. The user software has not read the previous data in the SPIxBUF register." name="" value="0x1"/>
         <value caption="No overflow has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Shift Register Empty bit" name="SPI4STAT__SRMT">
         <value caption="When SPI module shift register is empty" name="" value="0x1"/>
         <value caption="When SPI module shift register is not empty" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit Under Run bit" name="SPI4STAT__SPITUR">
         <value caption="Transmit buffer has encountered an underrun condition" name="" value="0x1"/>
         <value caption="Transmit buffer has no underrun condition" name="" value="0x0"/>
      </value-group>
      <value-group caption="SPI Activity Status bit" name="SPI4STAT__SPIBUSY">
         <value caption="SPI peripheral is currently busy with some transactions" name="" value="0x1"/>
         <value caption="SPI peripheral is currently idle" name="" value="0x0"/>
      </value-group>
      <value-group caption="SPI Frame Error status bit" name="SPI4STAT__FRMERR">
         <value caption="Frame error detected" name="" value="0x1"/>
         <value caption="No Frame error detected" name="" value="0x0"/>
      </value-group>
      <value-group caption="SPI Receive Buffer Full Status bit" name="SPI5STAT__SPIRBF">
         <value caption="Receive buffer" name="" value="0x1"/>
         <value caption="Receive buffer" name="" value="0x0"/>
      </value-group>
      <value-group caption="SPI Transmit Buffer Full Status bit" name="SPI5STAT__SPITBF">
         <value caption="Transmit not yet started" name="" value="0x1"/>
         <value caption="Transmit buffer is not full" name="" value="0x0"/>
      </value-group>
      <value-group caption="SPI Transmit Buffer Empty Status bit" name="SPI5STAT__SPITBE">
         <value caption="Transmit buffer" name="" value="0x1"/>
         <value caption="Transmit buffer" name="" value="0x0"/>
      </value-group>
      <value-group caption="RX FIFO Empty bit (valid only when ENHBUF = 1)" name="SPI5STAT__SPIRBE">
         <value caption="RX FIFO is empty (CRPTR = SWPTR)" name="" value="0x1"/>
         <value caption="RX FIFO is not empty (CRPTR ? SWPTR)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Receive Overflow Flag bit" name="SPI5STAT__SPIROV">
         <value caption="A new data is completely received and discarded. The user software has not read the previous data in the SPIxBUF register." name="" value="0x1"/>
         <value caption="No overflow has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Shift Register Empty bit" name="SPI5STAT__SRMT">
         <value caption="When SPI module shift register is empty" name="" value="0x1"/>
         <value caption="When SPI module shift register is not empty" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit Under Run bit" name="SPI5STAT__SPITUR">
         <value caption="Transmit buffer has encountered an underrun condition" name="" value="0x1"/>
         <value caption="Transmit buffer has no underrun condition" name="" value="0x0"/>
      </value-group>
